max555-max/empty_LP_MSPM0G3507_nortos_ticlang/Debug/ti_msp_dl_config.h
/*
 * Copyright (c) 2023, Texas Instruments Incorporated - http://www.ti.com
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  ============ ti_msp_dl_config.h =============
 *  Configured MSPM0 DriverLib module declarations
 *
 *  DO NOT EDIT - This file is generated for the MSPM0G350X
 *  by the SysConfig tool.
 */
#ifndef ti_msp_dl_config_h
#define ti_msp_dl_config_h

#define CONFIG_MSPM0G350X
#define CONFIG_MSPM0G3507

#if defined(__ti_version__) || defined(__TI_COMPILER_VERSION__)
#define SYSCONFIG_WEAK __attribute__((weak))
#elif defined(__IAR_SYSTEMS_ICC__)
#define SYSCONFIG_WEAK __weak
#elif defined(__GNUC__)
#define SYSCONFIG_WEAK __attribute__((weak))
#endif

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/driverlib.h>
#include <ti/driverlib/m0p/dl_core.h>

#ifdef __cplusplus
extern "C" {
#endif

/*
 *  ======== SYSCFG_DL_init ========
 *  Perform all required MSP DL initialization
 *
 *  This function should be called once at a point before any use of
 *  MSP DL.
 */


/* clang-format off */

#define POWER_STARTUP_DELAY                                                (16)



#define CPUCLK_FREQ                                                     80000000
/* Defines for SYSPLL_ERR_01 Workaround */
/* Represent 1.000 as 1000 */
#define FLOAT_TO_INT_SCALE                                               (1000U)
#define FCC_EXPECTED_RATIO                                                  2500
#define FCC_UPPER_BOUND                       (FCC_EXPECTED_RATIO * (1 + 0.003))
#define FCC_LOWER_BOUND                       (FCC_EXPECTED_RATIO * (1 - 0.003))

bool SYSCFG_DL_SYSCTL_SYSPLL_init(void);


/* Defines for PWM */
#define PWM_INST                                                           TIMG7
#define PWM_INST_IRQHandler                                     TIMG7_IRQHandler
#define PWM_INST_INT_IRQN                                       (TIMG7_INT_IRQn)
#define PWM_INST_CLK_FREQ                                               80000000
/* GPIO defines for channel 0 */
#define GPIO_PWM_C0_PORT                                                   GPIOA
#define GPIO_PWM_C0_PIN                                           DL_GPIO_PIN_26
#define GPIO_PWM_C0_IOMUX                                        (IOMUX_PINCM59)
#define GPIO_PWM_C0_IOMUX_FUNC                       IOMUX_PINCM59_PF_TIMG7_CCP0
#define GPIO_PWM_C0_IDX                                      DL_TIMER_CC_0_INDEX
/* GPIO defines for channel 1 */
#define GPIO_PWM_C1_PORT                                                   GPIOA
#define GPIO_PWM_C1_PIN                                           DL_GPIO_PIN_27
#define GPIO_PWM_C1_IOMUX                                        (IOMUX_PINCM60)
#define GPIO_PWM_C1_IOMUX_FUNC                       IOMUX_PINCM60_PF_TIMG7_CCP1
#define GPIO_PWM_C1_IDX                                      DL_TIMER_CC_1_INDEX



/* Defines for UART0 */
#define UART0_INST                                                         UART0
#define UART0_INST_FREQUENCY                                            40000000
#define UART0_INST_IRQHandler                                   UART0_IRQHandler
#define UART0_INST_INT_IRQN                                       UART0_INT_IRQn
#define GPIO_UART0_RX_PORT                                                 GPIOA
#define GPIO_UART0_TX_PORT                                                 GPIOA
#define GPIO_UART0_RX_PIN                                         DL_GPIO_PIN_11
#define GPIO_UART0_TX_PIN                                         DL_GPIO_PIN_10
#define GPIO_UART0_IOMUX_RX                                      (IOMUX_PINCM22)
#define GPIO_UART0_IOMUX_TX                                      (IOMUX_PINCM21)
#define GPIO_UART0_IOMUX_RX_FUNC                       IOMUX_PINCM22_PF_UART0_RX
#define GPIO_UART0_IOMUX_TX_FUNC                       IOMUX_PINCM21_PF_UART0_TX
#define UART0_BAUD_RATE                                                 (115200)
#define UART0_IBRD_40_MHZ_115200_BAUD                                       (21)
#define UART0_FBRD_40_MHZ_115200_BAUD                                       (45)




/* Defines for SPI_ICM42688 */
#define SPI_ICM42688_INST                                                  SPI1
#define SPI_ICM42688_INST_IRQHandler                            SPI1_IRQHandler
#define SPI_ICM42688_INST_INT_IRQN                                SPI1_INT_IRQn
#define GPIO_SPI_ICM42688_PICO_PORT                                       GPIOB
#define GPIO_SPI_ICM42688_PICO_PIN                                DL_GPIO_PIN_8
#define GPIO_SPI_ICM42688_IOMUX_PICO                            (IOMUX_PINCM25)
#define GPIO_SPI_ICM42688_IOMUX_PICO_FUNC            IOMUX_PINCM25_PF_SPI1_PICO
#define GPIO_SPI_ICM42688_POCI_PORT                                       GPIOB
#define GPIO_SPI_ICM42688_POCI_PIN                                DL_GPIO_PIN_7
#define GPIO_SPI_ICM42688_IOMUX_POCI                            (IOMUX_PINCM24)
#define GPIO_SPI_ICM42688_IOMUX_POCI_FUNC            IOMUX_PINCM24_PF_SPI1_POCI
/* GPIO configuration for SPI_ICM42688 */
#define GPIO_SPI_ICM42688_SCLK_PORT                                       GPIOB
#define GPIO_SPI_ICM42688_SCLK_PIN                                DL_GPIO_PIN_9
#define GPIO_SPI_ICM42688_IOMUX_SCLK                            (IOMUX_PINCM26)
#define GPIO_SPI_ICM42688_IOMUX_SCLK_FUNC            IOMUX_PINCM26_PF_SPI1_SCLK



/* Port definition for Pin Group LED */
#define LED_PORT                                                         (GPIOB)

/* Defines for LED1: GPIOB.22 with pinCMx 50 on package pin 21 */
#define LED_LED1_PIN                                            (DL_GPIO_PIN_22)
#define LED_LED1_IOMUX                                           (IOMUX_PINCM50)
/* Port definition for Pin Group ICM42688_CS */
#define ICM42688_CS_PORT                                                 (GPIOB)

/* Defines for CS: GPIOB.6 with pinCMx 23 on package pin 58 */
#define ICM42688_CS_CS_PIN                                       (DL_GPIO_PIN_6)
#define ICM42688_CS_CS_IOMUX                                     (IOMUX_PINCM23)
/* Port definition for Pin Group AIN */
#define AIN_PORT                                                         (GPIOA)

/* Defines for AIN1: GPIOA.24 with pinCMx 54 on package pin 25 */
#define AIN_AIN1_PIN                                            (DL_GPIO_PIN_24)
#define AIN_AIN1_IOMUX                                           (IOMUX_PINCM54)
/* Defines for AIN2: GPIOA.25 with pinCMx 55 on package pin 26 */
#define AIN_AIN2_PIN                                            (DL_GPIO_PIN_25)
#define AIN_AIN2_IOMUX                                           (IOMUX_PINCM55)
/* Port definition for Pin Group BIN */
#define BIN_PORT                                                         (GPIOB)

/* Defines for BIN1: GPIOB.25 with pinCMx 56 on package pin 27 */
#define BIN_BIN1_PIN                                            (DL_GPIO_PIN_25)
#define BIN_BIN1_IOMUX                                           (IOMUX_PINCM56)
/* Defines for BIN2: GPIOB.24 with pinCMx 52 on package pin 23 */
#define BIN_BIN2_PIN                                            (DL_GPIO_PIN_24)
#define BIN_BIN2_IOMUX                                           (IOMUX_PINCM52)
/* Port definition for Pin Group ENCODER */
#define ENCODER_PORT                                                     (GPIOA)

/* Defines for E1A: GPIOA.14 with pinCMx 36 on package pin 7 */
// pins affected by this interrupt request:["E1A","E1B","E2A","E2B"]
#define ENCODER_INT_IRQN                                        (GPIOA_INT_IRQn)
#define ENCODER_INT_IIDX                        (DL_INTERRUPT_GROUP1_IIDX_GPIOA)
#define ENCODER_E1A_IIDX                                    (DL_GPIO_IIDX_DIO14)
#define ENCODER_E1A_PIN                                         (DL_GPIO_PIN_14)
#define ENCODER_E1A_IOMUX                                        (IOMUX_PINCM36)
/* Defines for E1B: GPIOA.15 with pinCMx 37 on package pin 8 */
#define ENCODER_E1B_IIDX                                    (DL_GPIO_IIDX_DIO15)
#define ENCODER_E1B_PIN                                         (DL_GPIO_PIN_15)
#define ENCODER_E1B_IOMUX                                        (IOMUX_PINCM37)
/* Defines for E2A: GPIOA.16 with pinCMx 38 on package pin 9 */
#define ENCODER_E2A_IIDX                                    (DL_GPIO_IIDX_DIO16)
#define ENCODER_E2A_PIN                                         (DL_GPIO_PIN_16)
#define ENCODER_E2A_IOMUX                                        (IOMUX_PINCM38)
/* Defines for E2B: GPIOA.17 with pinCMx 39 on package pin 10 */
#define ENCODER_E2B_IIDX                                    (DL_GPIO_IIDX_DIO17)
#define ENCODER_E2B_PIN                                         (DL_GPIO_PIN_17)
#define ENCODER_E2B_IOMUX                                        (IOMUX_PINCM39)
/* Defines for DAT: GPIOA.22 with pinCMx 47 on package pin 18 */
#define GRAY_SERIAL_DAT_PORT                                             (GPIOA)
#define GRAY_SERIAL_DAT_PIN                                     (DL_GPIO_PIN_22)
#define GRAY_SERIAL_DAT_IOMUX                                    (IOMUX_PINCM47)
/* Defines for CLK: GPIOB.20 with pinCMx 48 on package pin 19 */
#define GRAY_SERIAL_CLK_PORT                                             (GPIOB)
#define GRAY_SERIAL_CLK_PIN                                     (DL_GPIO_PIN_20)
#define GRAY_SERIAL_CLK_IOMUX                                    (IOMUX_PINCM48)




/* clang-format on */

void SYSCFG_DL_init(void);
void SYSCFG_DL_initPower(void);
void SYSCFG_DL_GPIO_init(void);
void SYSCFG_DL_SYSCTL_init(void);

bool SYSCFG_DL_SYSCTL_SYSPLL_init(void);
void SYSCFG_DL_PWM_init(void);
void SYSCFG_DL_UART0_init(void);
void SYSCFG_DL_SPI_ICM42688_init(void);

void SYSCFG_DL_SYSTICK_init(void);

bool SYSCFG_DL_saveConfiguration(void);
bool SYSCFG_DL_restoreConfiguration(void);

#ifdef __cplusplus
}
#endif

#endif /* ti_msp_dl_config_h */
